-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 26, 2021 at 06:31 AM
-- Server version: 10.4.19-MariaDB
-- PHP Version: 7.4.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ride`
--

-- --------------------------------------------------------

--
-- Table structure for table `trip_info`
--

CREATE TABLE `trip_info` (
  `trip_id` int(11) NOT NULL,
  `trip_date` date NOT NULL,
  `starting_point` varchar(255) NOT NULL,
  `ending_point` varchar(255) NOT NULL,
  `starting_time` time NOT NULL,
  `starting_lat` double NOT NULL,
  `starting_lng` double NOT NULL,
  `ending_lat` double NOT NULL,
  `ending_lng` double NOT NULL,
  `number_of_seat` int(11) NOT NULL,
  `vehicle_number` varchar(25) NOT NULL,
  `vehicle_type` varchar(10) NOT NULL,
  `cost_seat` decimal(10,0) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `trip_info`
--

INSERT INTO `trip_info` (`trip_id`, `trip_date`, `starting_point`, `ending_point`, `starting_time`, `starting_lat`, `starting_lng`, `ending_lat`, `ending_lng`, `number_of_seat`, `vehicle_number`, `vehicle_type`, `cost_seat`) VALUES
(10001, '2021-07-26', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'Joypurhat Freedom Fighters Monument', '20:56:00', 25.096773499999998, 89.02271259999999, 25.053966488391016, 89.16572570800783, 12, '1456', 'microcar', '30'),
(10003, '2021-07-30', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'Joypurhat Freedom Fighters Monument', '05:11:00', 24.967014433340054, 89.01838048096727, 25.036000000000058, 89.11920000000003, 8, '1456', 'car', '30'),
(10007, '2021-08-26', 'আক্কেলপুর', 'Rajshahi College Road, Rajshahi, BGD', '23:00:00', 24.969216, 89.0175488, 24.361555033531765, 88.61563007748481, 10, '1456', 'Car', '30'),
(10008, '2021-08-20', 'Shaheb Bazar, Rajshahi, BGD', 'Joypurhat, Freedom Fighter Amarnath Nandi Road, Khetlal, BGD', '12:00:00', 24.364870000000053, 88.59841000000006, 25.036000000000058, 89.11920000000003, 98, 'DH-0172626', 'Car', '30'),
(10036, '2021-08-17', 'Dhanmondi 27 More, Dhanmandi, Dhaka, BGD', 'Bogra Zilla School, N5, Bogra, BGD', '10:00:00', 23.75633504183792, 90.3752050829936, 24.84645000000006, 89.37279000000007, 4, 'B-12091', 'Car', '30'),
(10037, '2021-08-27', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', '05:51:00', 24.966946682923727, 89.01891372043356, 24.96661619546408, 89.02295984665916, 10, '123', 'Car', '30'),
(10038, '1970-01-01', '', '', '01:00:00', 0, 0, 0, 0, 0, '', '', '30'),
(10039, '2021-08-26', 'বাদলগাছি', 'আক্কেলপুর', '06:53:00', 24.9987072, 88.997888, 24.985991163625847, 89.0174961090088, 10, '145', 'Micro-car', '30'),
(10040, '2021-08-26', 'বাদলগাছি', 'আক্কেলপুর', '06:53:00', 24.9987072, 88.997888, 24.985991163625847, 89.0174961090088, 10, '145', 'Micro-car', '30'),
(10041, '2021-08-27', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', '02:53:00', 24.96694669847329, 89.01891352986176, 24.966538984864254, 89.02442220372266, 12, '1456', 'Car', '30'),
(10042, '1970-01-01', '', '', '01:00:00', 0, 0, 0, 0, 0, '', '', '30'),
(10043, '2021-08-27', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', '02:53:00', 24.96694669847329, 89.01891352986176, 24.966538984864254, 89.02442220372266, 12, '1456', 'Car', '30'),
(10044, '2021-08-28', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', '08:54:00', 24.96694669847329, 89.01891352986176, 24.96652391188975, 89.02481012368844, 12, '1233', 'Cng', '30'),
(10045, '2021-08-27', 'বাদলগাছি', 'আক্কেলপুর', '06:57:00', 24.9987072, 88.997888, 24.981323201745166, 89.03981208801271, 12, '123', 'Cng', '30'),
(10046, '2021-08-20', 'বাদলগাছি', 'আক্কেলপুর', '04:57:00', 24.9987072, 88.997888, 24.985679971680355, 89.02779579162598, 20, '123', 'Car', '30'),
(10047, '2021-08-26', 'বাদলগাছি', 'বাদলগাছি', '06:58:00', 24.9987072, 88.997888, 24.98490198837074, 89.01354789733888, 10, '145', 'Cng', '30'),
(10048, '2021-08-26', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', 'বাদলগাচি-আক্কেলপুর রোড, আকিলপুর, আক্কেলপুর', '06:58:00', 24.96694669847329, 89.01891352986176, 24.968095488436184, 89.02800925674069, 10, '145', 'Bike', '30'),
(10049, '0000-00-00', '', '', '00:00:00', 0, 0, 0, 0, 0, '', '', '30'),
(10050, '2021-08-19', 'বাদলগাছি', 'Z5202, Akkelpur', '06:34:00', 24.9987072, 88.997888, 24.972501867314733, 89.04822612334323, 12, '145', 'Cng', '30'),
(10051, '2021-08-26', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'Uttara, New Circular Road, Malibag, Dhaka, BGD', '16:35:00', 23.941873834896988, 90.3839555011711, 23.744420000000048, 90.41402000000005, 12, '1456', 'Car', '0'),
(10052, '2021-08-28', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'Rajshahy, BGD', '17:38:00', 23.941873834896988, 90.3839555011711, 24.378690000000063, 88.60932000000008, 12, '145', 'Bike', '0'),
(10053, '2021-08-27', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', '16:41:00', 23.941873834896988, 90.3839555011711, 23.932307143384286, 90.38782564206265, 10, '1456', 'Car', '0'),
(10054, '2021-08-27', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'কাকলী ইলেক্ট্রনিক্স', '18:42:00', 23.941873834896988, 90.3839555011711, 23.929740000000038, 90.38884000000007, 10, '145', 'Bike', '0'),
(10055, '2021-08-17', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'নুর হোটেল', '18:45:00', 23.941873834896988, 90.3839555011711, 23.929530000000057, 90.38892000000004, 12, '1233', 'Bike', '0'),
(10056, '2021-08-27', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'Homeo Health Complex', '17:46:00', 23.941873834896988, 90.3839555011711, 23.977510000000052, 90.38111000000004, 12, '145', 'Bike', '0'),
(10057, '2021-08-26', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', '17:48:00', 23.941873834896988, 90.3839555011711, 23.93317755058525, 90.38756452119688, 10, '145', 'Bike', '0'),
(10058, '2021-08-31', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'গাজীপুর সদর', '18:39:00', 23.941873834896988, 90.3839555011711, 23.953683930734183, 90.39417777210475, 10, '1233', 'Bike', '25'),
(10059, '2021-08-31', 'ঢাকা-ময়মনসিংহ রোড, গাজীপুর সদর', 'গাজীপুর সদর', '18:41:00', 23.941873834896988, 90.3839555011711, 23.95360947548376, 90.39428472518921, 12, '1233', 'Micro-car', '21');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `trip_info`
--
ALTER TABLE `trip_info`
  ADD PRIMARY KEY (`trip_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `trip_info`
--
ALTER TABLE `trip_info`
  MODIFY `trip_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10060;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
